[
    {
        "name": "EVGA GeForce GTX 1080 Ti FTW3 GAMING, 11GB GDDR5X, iCX Technology - 9 Thermal Sensors & RGB LED G/P/M, 3x Async Fan Control, Optimized Airflow Design Graphics Card 11G-P4-6696-KR", 
        "price": "$779.99", 
        "total_ratings": "4.5 out of 5 stars", 
        "customer_reviews": "182", 
        "#_of_answers": "112 answered questions", 
        "ratings": {
            "2 star": "4%", 
            "1 star": "19%", 
            "4 star": "5%", 
            "3 star": "3%", 
            "5 star": "69%"
        }, 
        "reviews": [
            {
                "review_header": "The performance this card offers is unbelievable - just don't buy from 3rd party sellers", 
                "review_text": "UPDATED 04/18/2017: See the bottom of this review for more info I can't be concise with this review, but I will try to include only the things I was concerned with when upgrading my graphics card. I bought this card with the intent to use EVGA's step-up program to upgrade to EVGA's GTX 1080 Ti FTW3 in the coming months, but after going over the terms and conditions of the step-up program again, it seems that that will be unlikely to occur. The graphics cards you are allowed to step-up to are mainly ones that use reference boards, with exceptions only rarely occurring, which means THIS particular 1080 Ti and perhaps 1 or 2 other stock-models are likely the only EVGA versions of the card you'll ever be able to step-up to from another graphics card, but I could be wrong. I can't post a link, but go to EVGA's website and read about the step-up program for more info. Even after learning this, however, I am not dismayed because this graphics card performs beyond my expectations as-is. I am coming from EVGA's GTX 980 FTW, which I have owned for exactly 2 years at the time of writing this and has never disappointed me once. About a month ago my 980 started dying (both of my monitors began losing signal randomly and not recovering in certain games), but before that I knew this card was coming, I wanted the new performance, and I didn't want to wait another 2 months for EVGA to put out their custom versions of the card, so ultimately the decline of my 980 is what pushed me to buy this card so early. ____________________ Performance: If you look at Nvidia's webpage for the GTX 1080 Ti FE, you'll see their claim that the 1080 Ti FE has an average performance gain of close to 75% compared to a GTX 980 in Mass Effect Andromeda and The Division, and over 100% performance gain on average in VR games. I don't do VR, but because I have both of the aforementioned graphics cards and games, I tested these claims and can confirm they are accurate. I also play Rainbow 6 Siege often, and a similar performance gain applies there as well. Note: the following FPS averages I'm about to give you are being recalled from my memory and are in no way professionally recorded. If anyone is interested, I can go back and do some more formal benchmarks with my 1080 Ti (not my 980 FTW, because I have already sold it) and update this review with some pictures. On Siege, with my 980, the average FPS was around 110 using the Ultra preset, rarely dipping below 70 FPS. On Siege, with my 1080 Ti, the average FPS is around 170 using the Ultra preset, rarely dipping below 130 FPS. I didn't record my FPS using my 980 in Watch Dogs 2, but with my 1080 Ti, using the Ultra preset and Temporal AA turned on, my average FPS is within 80-90, rarely dipping below 50. These benchmarks were recorded at the resolution 1920x1080. ____________________ Noise and Temperatures: Regarding the noise level and temperature of this graphics card: I've seen many suggestions in the past to avoid graphics cards with reference coolers because they run hotter and louder than most custom coolers. This is the first graphics card with a reference cooler that I have ever owned, but so far it is much more quiet under load than my 980 FTW has ever been under load. At idle, the noise both cards produce is about the same. The temperatures this card reaches under load are a bit higher than my 980 FTW ever reached under load using my custom fan curve. For example, using my custom fan curve yields a max temperature of 63 C on this 1080 Ti FE, and a max temperature of 55 C on my 980 FTW. I didn't record an idle temperature for my 980 FTW, but this 1080 Ti FE has an idle temperature of 52 C using the stock fan curve. To me this is nothing major and I am happy with the results, but if this matters much to you, you might be better off waiting for a 1080 Ti with a better cooler. Someone mentioned in a comment that EVGA has made a hybrid cooling kit for the 1080 Ti, which is an all-in-one liquid cooling solution that you can buy from EVGA's website. This is also a valid option for maintaining better temperatures and higher overclocks than the standard 1080 Ti FE. ____________________ Recommended monitors pairings: Now, I previously mentioned that I play at 1080p. Some people will say that the 1080 Ti is overkill for this resolution, and if you are playing at 60 Hz, that is correct, even for this year's and probably the next 3 years' AAA games. It is a completely different story if you play at 144 Hz, which I do. With the 1080 Ti, there are very few games you will not be able to reach 144 FPS in at max or close to max graphics settings at 1080p. So for anyone playing at 144 Hz and coming from any graphics card below the GTX 1080, the 1080 Ti will be a substantial upgrade. Many people will say that 2560x1440 at 144 Hz is the sweet spot resolution and refresh rate combo for the 1080 Ti, and I completely agree. With that combo, there are very few games that will not reach 100+ FPS with the 1080 Ti, and although I don't currently have a 1440p monitor to test that claim with, I believe I can make that claim with confidence because I did test a 1440p monitor a short while ago with my 980 and in most of 2016's games at Ultra presets, I very rarely did not achieve 80+ FPS. If you value higher resolutions over higher refresh rates, the 1080 Ti is also the best card available for playing at 4k 60 Hz, as there seem to be very few games in which it will not reach 60 FPS at Ultra presets. If you are reading this review and thinking about buying this graphics card, you are probably already aware of the new 4k 144 Hz monitors coming out this year from Acer and Asus. Although the 1080 Ti is fantastic for 1440p 144 Hz and 4k 60 Hz, I would strongly advise against pairing this with one of the new 4k 144 Hz monitors. Unless you are willing to make great compromises in games' graphics settings, there are very few games where the 1080 Ti will be able to achieve 100+ FPS at 4k. If you do intend to get one of those new monitors, I highly suggest waiting for one of the new graphics cards coming out in 2018. Not only should the highest end graphics card of that year be a significantly better match for 4k 144 Hz than the 1080 Ti, but also the 4k 144 Hz monitors may drop in price by that time and there may be more options available. This is purely speculation, so please do not take my word as fact. ____________________ Pricing: Finally, I would like to discuss the current price of this product at the time of writing this review. The lowest price I see on Amazon right now is $859 from a 3rd party seller. If you are thinking about buying this graphics card, please listen to the other reviewers and do not pay anything more than the advertised $699 MSRP for this graphics card, and do not buy from any 3rd party sellers because you may not have an easy return process if something goes wrong. I was lucky enough to buy at the MSRP before Amazon ran out of stock, but hopefully Amazon will get more of these in the coming weeks and the price should return to normal. With the 1080 Ti, you are getting Titan XP performance for nearly half the price, so do yourself a favor and DO NOT pay more than the MSRP (+ tax and shipping if necessary). If you have any questions or would like me to perform more benchmarks, I will be happy to answer them and/or update this review. Additionally, should this card stop working and require RMA, I will update this review with my EVGA RMA experience and adjust rating accordingly if necessary. ____________________ UPDATE 03/27/2017: I added titles and dividers to the different sections of this review, so hopefully that makes it a little easier to navigate. I also decided to do some proper benchmarks so you have actual numbers and not just what I remember. The pictures below are benchmarks of The Division, Rainbow Six: Siege, and Deus Ex: Mankind Divided, performed at the resolutions 1920x1080 and 2560x1440, using the games' built-in benchmark tools, and with the following hardware: CPU: Intel i7 6700k RAM: 16 GB DDR4 @ 2400 MHz GPU: EVGA GTX 1080 Ti Founders Edition Note: the average frame rates from those benchmarks may not necessarily reflect all in-game scenarios. Another thing I wanted to mention that I forgot in the original review is that the only other hardware that comes with this graphics card is a DVI to DisplayPort adapter, and the adapter does NOT support 144 Hz. To enable 144 Hz on a monitor that supports it while using this graphics card, you will need either a DisplayPort cable (version 1.2 or higher) or an HDMI cable (version 1.3 or higher), and this graphics card comes with neither of those, so make sure that you buy one with this card if you don't already have one of those. ____________________ UPDATE: 04/18/2017 I added a photo of my overclock and fan curve for anyone who is curious. You'll notice that I have my core clock set to +100 MHz and memory clock set to +250 MHz. I haven't attempted any overclocks higher than that yet because I'm waiting until I can get a hold of a hybrid kit, but so far this is stable and gives me a performance boost of anywhere from 2 to 10 fps, as it varies among games. Do keep in mind that like all other graphics cards, not every 1080 Ti will be able to achieve the same overclocks; some will have a higher threshold before the overclock begins to negatively affect performance, and some will have a lower threshold. I do not know the limit of my card, nor the average limit among all 1080 Ti's, but generally the difference between the best- and worst- overclocking graphics cards of the same kind is very small, as in a 2-4 fps difference. I am only a novice at overclocking, so if you have any questions regarding that, it would be better to ask someone more experienced in that area, but here you have my current experience. Also, since I first wrote this review I have modified my custom fan curve to make my graphics card slightly more quiet under load and cooler at idle. My current custom fan curve yields an idle temp and load temp of 42 C and 67 C, respectively (previously, they were 50 C and 63 C). My graphics card is now slightly louder at idle, but realistically I can't tell the difference because I always wear headphones while using this PC. Also, the temperature of the room I use this PC in is usually 20 C (68 F) when I first turn the PC on, and progressively gets warmer while my graphics card is under load. Note that your room temperature may rise while the GPU is under load (depending on room size), as it exhausts a LOT of hot air, and this may in return cause your GPU's idle temps to rise until the room temp returns to normal. The program I used to modify my overclock and fan curve is EVGA Precision XOC, but in case you didn't already know, MSI Afterburner is a popular alternative and works just fine with this graphics card, too. In case you can't tell from the picture, here are the numbers from the graph of my fan curve: Temperature | Fan Speed % ---------------------------------------- 30 C | 35% 55 C | 50% 70 C | 75% 80 C | 100%", 
                "review_comment_count": "22", 
                "review_posted_date": "21 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Intelo"
            }, 
            {
                "review_header": "1080ti FTW 3 is a stunning master piece! quick review with EYE CANDY INCLUDED", 
                "review_text": "FTW 3 is an awesome buy and it runs soooo cold definitely happy with my purchase i put it in my brothers pc and my pc it looks beautiful anywhere you put it. This gpu is a beast and gonna make me very happy for years to come uploaded tons of pics as eye candy for those considering buying it! ENJOY! also included in the pics is a 1070 next to the 1080ti mind you the 1070 was almost 30% bigger then the 970 so this 1080 is HUGE and that a mid tower that 1080ti is sitting in so keep in mind it will be a tight fit! LAST PIC IS SOME SPECS OF MY PC + STATS ON HARDWARE INCLUDING GPU ENJOY!!!! I hope you all enjoyed this extremely messy review <3 :D happy shopping!", 
                "review_comment_count": "1", 
                "review_posted_date": "23 May 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Austin Hines"
            }, 
            {
                "review_header": "Wow! Keeps cool, 30c-60c while gaming!", 
                "review_text": "I already had the GTX 1080 Ti Founders Edition, so this was more of trying to achieve better temperatures. The performance was obviously the same, but the Founders Edition would regularly reach temps of 86c. According to GeForce, this is normal for the FE cards. With the Hybrid card I stay at the same idle of 28c as the Founders Edition, but where it shines is under heavy gaming load. I see anywhere from 36c to 56c while gaming for a couple of hours with modern, hardware demanding games. I live in a hot dry area of the US. I am really impressed with this card. Space was a little tight for my case, motherboard, and previously installed CPU water cooling, but I worked it out. I left the fan as is and allowed it to exhaust through the radiator and out the case.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Jun 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "After 60 days 24/7 is it still worth it? Oh yeah", 
                "review_text": "You know the specs for this graphics card so pointing them out here is a waste of time. This card was installed into a case with great cooling and will take advantage of the rear exhausted card. After 60 days is it still worth it? Yes! Could I have waited for a 3rd party vendor for an OC version with better cooling at near the same price? Yes! I needed a graphics card to replace an older card that failed in a i7- 4790 system running a 2560x1440 single monitor. I considered waiting for an AMD RX580 or buy it now GTX OC GTX 1060 6GB. The price of the GTX 1080-TI was roughly double that of the GTX 1060 6GB at the time but would extend the usable life of the system by at least three years. The GTX 1080-TI would still make a viable pass down graphics card for an additional few more years. Let's face it, the GTX 1080-TI is nearly on par with the Titan-Xp flagship. Yes the benchmarks are slightly different but real world there is nothing to justify the added expense for the Titan. Did I get double the performance with the GTX 1080-TI over the GTX 1060 6Gb? I really do not know because I have yet to push the 1080-TI to the limits of the card as I have with the GTX 1060. Regret not buying a GTX 980 or GTX 980-TI? Well the GTX 1060 OC 6B is less than half the original cost of the 980 and performs better overall. If you need a good graphics card now the GTX 1080-TI will handle 144Hz QHD with ease or single 4K decently if that is what you need.", 
                "review_comment_count": "", 
                "review_posted_date": "12 Jun 2017", 
                "review_rating": "5.0 ", 
                "review_author": " TexasTea"
            }, 
            {
                "review_header": "Monster", 
                "review_text": "Bought this as an upgrade from my EVGA 780 TI, PSU fried and took my card, so i took advantage of this as an upgrade. this thing is a monster, I have no games this thing cant handle on ultra settings, modded, etc. I play everything on 4K and im using a 2nd monitor at the same time. Doesnt slow down at all. Well worth the $$ if you can spare it. Would buy another if i needed too for whatever reason.", 
                "review_comment_count": "", 
                "review_posted_date": "02 May 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Andrew K"
            }
        ], 
        "url": "http://www.amazon.com/dp/B06Y15DWXR"
    }
]